[
  {
    "name": "0mega",
    "description": "0mega (with a zero instead an O) is a ransomware group that seemingly moves slowly based on the rate at which they add victims to their extortion page. They've added three victims to their extortion website - available on both Clearnet and TOR - in the first year of their existence. However, don't be fooled; it's very likely that more attacks are occurring but aren't listed due to the victim paying or because the attack wasn't successful (enough). The group may act gingerly, but because there is yet to be a known sample or analysis of this ransomware, it's difficult to uncover the group's tactics and techniques of infiltrating networks, not to mention the telemetry of when they breach. We are aware of at least one other victim when Obsidian Security's threat research team revealed in a blog post a SaaS account compromise that led to data theft. Allegedly, they didn't encrypt any files during this breach. However, they did drop a ransom note titled \"PREVENT-LEAKAGE.txt\"",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active (low activity)",
    "activity": "Ransomware with double-extortion model including data theft",
    "tactics & techniques": "File encryption, data exfiltration, cloud account compromise, extortion via leak threats",
    "activity period": "May 2022 – 2024",
    "notable": "Known for abusing Microsoft 365 admin access in some incidents",
    "victims & reach": "Small to mid-sized organizations",
    "impact": "Limited global impact compared to major ransomware families"
  },
  {
    "name": "8base",
    "origin": "Thailand",
    "description": "8Base is an aggressive ransomware and data-extortion collective that became a major global threat between 2022 and 2025. The group's operations were severely disrupted in February 2025 through \"Operation Phobos Aetor,\" a coordinated international law enforcement effort involving the FBI, Europol, and authorities from several other nations.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Disrupted (law enforcement action)",
    "activity": "Ransomware and data-leak extortion operations",
    "tactics & techniques": "Phishing, initial access brokers, AES-based encryption, double extortion",
    "activity period": "2022 – 2025",
    "notable": "International law enforcement arrests and server seizures in 2025",
    "victims & reach": "Hundreds of victims across multiple industries worldwide",
    "impact": "High; associated with the Phobos ransomware ecosystem"
  },
  {
    "name": "Abyss",
    "description": "Abyss (also known as Abyss Locker) is a sophisticated ransomware-as-a-service (RaaS) operation that first gained prominence in March 2023. As of January 2026, it remains an active and evolving threat, known for its technical versatility across multiple platforms.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Double-extortion ransomware operations",
    "tactics & techniques": "Data exfiltration, file encryption, ESXi targeting, ChaCha-based encryption",
    "activity period": "2023 – Present",
    "notable": "Uses a public leak site to pressure victims",
    "victims & reach": "Enterprises across multiple regions",
    "impact": "Moderate but growing"
  },
  {
    "name": "Adminlocker",
    "description": "Adminlocker is a low-profile, opportunistic ransomware strain active since late 2021 that primarily targets individual users and small businesses through cracked software and malicious email attachments. Operating as a likely independent or small-scale group with unconfirmed geographical origins, it utilizes a hybrid of AES and RSA encryption to lock files—often appending extensions like .admin1 or .1admin—and demands Bitcoin payments via local text file instructions. Unlike more advanced syndicates, Adminlocker typically focuses on single-extortion file encryption rather than maintaining a public data-leak site, resulting in a more localized and limited global impact as of 2026.",
    "status": "Active (low visibility)",
    "activity": "File-encrypting ransomware",
    "tactics & techniques": "Symmetric and asymmetric encryption, ransom notes via local files",
    "activity period": "2021 – Present",
    "notable": "Uses multiple file extensions such as .admin1",
    "victims & reach": "Small businesses and individual systems",
    "impact": "Limited and localized"
  },
  {
    "name": "Akira",
    "description": "Akira is a prominent Russian-linked Ransomware-as-a-Service (RaaS) operation that emerged in early 2023 and has since evolved into a Tier-1 global threat, extorting an estimated $244 million from over 1,000 victims by early 2026. The group, frequently linked to the defunct Conti syndicate, employs a sophisticated double-extortion strategy that combines data exfiltration with high-speed encryption across Windows, Linux, VMware ESXi, and newer Nutanix AHV environments. Their primary tactics involve opportunistic exploitation of unpatched VPN vulnerabilities (notably in Cisco and SonicWall devices) and the abuse of single-factor authentication to gain initial access. As of January 2026, Akira remains highly active, recently shifting toward \"pure extortion\" models that bypass traditional encryption to focus on high-leverage data theft from mid-market firms and critical infrastructure sectors globally.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Ransomware with double-extortion strategy",
    "tactics & techniques": "Credential abuse, VPN exploitation, data exfiltration, Rust-based encryption",
    "activity period": "March 2023 – Present",
    "notable": "Targets Windows, Linux, and VMware ESXi systems",
    "victims & reach": "Hundreds of organizations globally",
    "impact": "High; millions of dollars in ransom demands"
  },
  {
    "name": "Alphalocker",
    "description": "The first mentions of Alpha Locker, or Alpha, appeared in Bleeping Computer's forums in the Summer of 2023. However, in early January, the group appeared more ubiquitously within the cybersecurity community. This group is also known as \"mydaya\" because of the TOR domain name on which they host their data leak site. Nothing is known about the group besides what is on the data leak site and what is published on the Bleeping Computer forums.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Ransomware and data extortion operations",
    "tactics & techniques": "File encryption, data leakage threats, Tor-based negotiations",
    "activity period": "2024 – Present",
    "notable": "Distinct from older AlphaLocker variants; modern extortion group",
    "victims & reach": "Approximately 30 publicly disclosed victims",
    "impact": "Moderate"
  },
  {
    "name": "Abraham's Ax",
    "origin": "Iran",
    "description": "Abraham's Ax appears to be a \"one and done\" operation. Based on multiple characteristics of the extortion link site, the operators seem to be linked to Moses Staff, an Iranian hacktivist group. Researchers from IBM highlighted all of the similarities between the groups, which is further attributed to an entity dubbed COBALT SAPLING. Since these groups are allegedly the same threat actors, they subsequently use the same tactics, techniques, and procedures (TTPs). The group leverages a remote access trojan (RAT) called StrifeWater RAT, which allows them to send remote commands and deploy what we can assume is ransomware. Although, there is no evidence of ransomware ever being deployed.",
    "type": "Data Broker",
    "status": "Inactive / One-time operation",
    "activity": "Data extortion and data leakage without confirmed ransomware deployment",
    "tactics & techniques": "Use of StrifeWater RAT, data exfiltration, direct and double extortion, hacktivist-style operations",
    "activity period": "November 2022",
    "notable": "Linked to Iranian hacktivist group Moses Staff and threat cluster COBALT SAPLING",
    "victims & reach": "Government sector; Saudi Arabian Ministry of Interior",
    "impact": "High political and reputational impact but limited operational scale"
  },
  {
    "name": "ALPHV (BlackCat / Noberus)",
    "origin": "Russia",
    "description": "A high-profile ransomware-as-a-service (RaaS) gang that deploys the ALPHV ransomware written in Rust. It uses advanced double- and sometimes triple-extortion techniques. Operates via affiliates who deploy the malware and share ransom profits. Maintains public leak sites for stolen data.",
    "type": "Crypto-Ransomware, Ransomware-as-a-Service (RaaS)",
    "status": "Disrupted / largely inactive post-2024; infrastructure seized by law enforcement.",
    "activity": "Previously highly active across multiple industries, but operations diminished following takedown.",
    "tactics & techniques": "Double extortion (encrypt + data leak), sometimes triple extortion; exploitation, credential theft; custom Rust binary.",
    "activity period": "First observed in late 2021, peaked through 2023; disrupted late 2023–2024.",
    "notable": "One of the most active ransomware strains with reputed ties to FIN7 and DarkSide affiliates.",
    "victims & reach": "Hundreds of victims worldwide across government, healthcare, education, manufacturing, etc.",
    "impact": "Significant global impact, major ransom payments, data leaks, and operational disruption."
  },
  {
    "name": "Apt73",
    "description": "Emerging ransomware group identified by threat intel platforms; minimal verified public profile. Known channels like Ransomware.Live list it with some reported victims but lack official analysis.",
    "type": "Crypto-Ransomware, Data Broker, Ransomware-as-a-Service (RaaS)",
    "status": "Active (reported victims listed)",
    "activity": "Linked to multiple claimed attacks per dark web tracking sites.",
    "tactics & techniques": "Details not widely published; associated with claimed attacks.",
    "activity period": "Reported mid-2024 onward.",
    "notable": "Listed as a ransomware group with a modest victim count.",
    "victims & reach": "≈78 victims listed in intelligence catalogs.",
    "impact": "Insufficient independent reporting to assess impact."
  },
  {
    "name": "Arcusmedia",
    "description": "A RaaS group first observed in mid-2024 operating a double extortion ransomware called Arcus Media. Targets include businesses across multiple sectors.",
    "type": "Data Broker, Ransomware-as-a-Service (RaaS)",
    "status": "Active",
    "activity": "Linked to 50+ attacks across industries globally by mid-2025.",
    "tactics & techniques": "Double-extortion, selective encryption, exploit phishing and lateral-movement tools.",
    "activity period": "First observed May 2024.",
    "notable": "Associated with confirmed breach incidents per OSINT listings.",
    "victims & reach": "Multiple sectors including retail, healthcare, media across Americas, Europe, Asia.",
    "impact": "Operational disruptions and data leaks across varied victim profile."
  },
  {
    "name": "Argonauts",
    "description": "A data extortion group focused on exfiltrating and exposing data rather than encryption. Evidence of traditional ransomware use is limited.",
    "type": "Data Broker",
    "status": "Active",
    "activity": "Targeted entities in Italy, Taiwan, Japan, Canada, U.S. per intelligence sources.",
    "tactics & techniques": "Data theft and public leak sites to pressure victims.",
    "activity period": "Active since ~late 2024.",
    "notable": "Claims large data thefts from corporates in multiple regions.",
    "victims & reach": "Reported victims in multiple countries by OSINT trackers.",
    "impact": "Primarily data exposure pressure; encryption capability unclear."
  },
  {
    "name": "Arkana",
    "description": "A network intruder and data extortion operation with limited evidence of traditional ransomware encryption. Uses leak and doxxing tactics to coerce payment.",
    "type": "Data Broker",
    "status": "Active",
    "activity": "Publicly linked to leaks and pressure campaigns against U.S. and UK targets.",
    "tactics & techniques": "Post-intrusion lateral movement and data leak threats.",
    "activity period": "Observed since early 2025.",
    "notable": "High-profile breaches leveraged for extortion but not verified as encrypting ransomware.",
    "victims & reach": "Various sectors including telecom, mining and entertainment.",
    "impact": "Public exposure and pressure tactics rather than system encryption."
  },
  {
    "name": "Arvinclub",
    "description": "Characterized mainly as a data leak / hacktivist-style group with no verified evidence of ransomware encryption.",
    "type": "Crypto-Ransomware",
    "status": "Inactive / limited reporting",
    "activity": "Published stolen data; ransomware capability unclear.",
    "tactics & techniques": "Data dumps and hacktivist messaging channels.",
    "activity period": "First seen ~2021.",
    "notable": "Associated with Telegram activity and data dumps.",
    "victims & reach": "Limited documented victim records.",
    "impact": "Primarily reputational/data leaks; no confirmed encryption incidents."
  },
  {
    "name": "Avaddon",
    "description": "A ransomware offered via affiliate programs that encrypts victim files and typically demands ransom via TOR payment portals. It has been documented with a distinctive .avdn extension.",
    "type": "Crypto-Ransomware",
    "status": "Activity declined; historic known threat",
    "activity": "Distributed via spam and exploit vectors; involved in numerous breaches before waning activity.",
    "tactics & techniques": "Traditional file encryption with extortion; backed by affiliate model.",
    "activity period": "First widespread campaigns early 2020; declined in later years.",
    "notable": "Documented malware with technical analyses published in academic sources.",
    "victims & reach": "Impacted many organizations during high activity phase.",
    "impact": "Encrypted systems, disrupted services, data leakage pressure."
  },
  {
    "name": "AvosLocker",
    "description": "AvosLocker is a ransomware-as-a-service operation that encrypts victim systems and exfiltrates data for double extortion. Affiliates deploy the malware and threaten public data leaks if ransom demands are not met.",
    "type": "Crypto-Ransomware, Data Broker, Ransomware-as-a-Service (RaaS)",
    "status": "Inactive / Dormant",
    "activity": "Previously active across corporate, government, and critical infrastructure sectors. Activity significantly declined after mid-2023.",
    "tactics & techniques": "Phishing, exploitation of vulnerabilities, RDP compromise, lateral movement, data exfiltration, shadow copy deletion.",
    "activity period": "2021 – 2023",
    "notable": "Referenced in joint law enforcement and cybersecurity advisories due to impact on critical infrastructure.",
    "victims & reach": "Victims across North America, Europe, Asia, and the Middle East.",
    "impact": "Operational disruption, data exposure, and financial extortion."
  },
  {
    "name": "Babuk",
    "description": "Babuk is a ransomware group that deployed Babuk Locker to encrypt networks and exfiltrate data for double extortion. The group gained notoriety after attacking government and enterprise targets. Its source code was leaked in 2021, enabling multiple derivative ransomware families.",
    "type": "Crypto-Ransomware",
    "status": "Inactive (original group)",
    "activity": "Highly active in 2021 before fragmenting following source code leaks.",
    "tactics & techniques": "Double extortion, phishing, lateral movement, use of post-exploitation frameworks, deletion of backups.",
    "activity period": "2021",
    "notable": "Attack on Washington D.C. Police Department and public release of stolen data.",
    "victims & reach": "Government agencies and enterprises primarily in the United States and Europe.",
    "impact": "Widespread disruption and long-term influence due to leaked ransomware code."
  },
  {
    "name": "Babuk2",
    "description": "Babuk2 is a ransomware and extortion group using the Babuk name and branding. Analysts assess it as a separate operation from the original Babuk group. It primarily operates through data leak threats, with some claims later found to be recycled or unverifiable.",
    "type": "Crypto-Ransomware",
    "status": "Active",
    "activity": "Public leak site activity with numerous claimed victims, though independent verification varies.",
    "tactics & techniques": "Data theft, public extortion, reputational pressure; encryption activity inconsistent.",
    "activity period": "2024 – Present",
    "notable": "Known for controversial victim claims and reuse of older breach data.",
    "victims & reach": "Claims victims across multiple regions and industries.",
    "impact": "Primarily reputational damage and extortion pressure."
  },
  {
    "name": "Beast",
    "description": "Beast is a ransomware-as-a-service platform offering customizable ransomware binaries for affiliates. It supports Windows, Linux, and ESXi environments and uses strong cryptography for file encryption along with extortion tactics.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Ongoing affiliate-driven campaigns with confirmed leak site postings.",
    "tactics & techniques": "Custom ransomware builds, data encryption, backup deletion, system discovery, and extortion threats.",
    "activity period": "2022 – Present",
    "notable": "Known for highly configurable ransomware payloads.",
    "victims & reach": "Victims reported globally across multiple industries.",
    "impact": "Business disruption, encrypted systems, and data exposure."
  },
  {
    "name": "Benzona",
    "description": "Benzona is an emerging ransomware group that uses double extortion tactics. It encrypts victim files and threatens to publish stolen data if ransom demands are not met. Early activity targeted automotive, healthcare, and manufacturing sectors.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Ongoing campaigns reported since late 2025.",
    "tactics & techniques": "File encryption, data exfiltration, shadow copy deletion, extortion via leak threats.",
    "activity period": "2025 – Present",
    "notable": "Identified as an emerging ransomware threat in industry threat advisories.",
    "victims & reach": "Victims reported in Europe and Africa.",
    "impact": "Operational disruption and data compromise."
  },
  {
    "name": "Bert",
    "description": "Bert is a ransomware group targeting Windows and Linux environments. It uses PowerShell-based loaders and performs concurrent encryption to maximize impact, alongside data exfiltration threats.",
    "type": "Data Broker",
    "status": "Active",
    "activity": "Confirmed attacks against organizations in Asia, Europe, and North America.",
    "tactics & techniques": "PowerShell loaders, privilege escalation, multi-threaded encryption, data theft.",
    "activity period": "2025 – Present",
    "notable": "Tracked by multiple cybersecurity vendors due to cross-platform targeting.",
    "victims & reach": "Healthcare, technology, and services sectors.",
    "impact": "Encrypted systems, data exposure, and business disruption."
  },
  {
    "name": "Bianlian",
    "description": "Bianlian is a ransomware and data extortion group that has evolved from encryption-based attacks into primarily exfiltration-based extortion, threatening to leak stolen data if ransom demands are not met. The group uses valid RDP credentials and common post-exploitation tools to access and traverse victim networks.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active with shifting tactics",
    "activity": "Targeted multiple U.S. critical infrastructure sectors and private organizations in Australia and the UK since mid-2022; shifted away from encryption towards pure data extortion since 2024.",
    "tactics & techniques": "Uses remote access (RDP credentials), open-source tools, data exfiltration via FTP/Rclone, and public leak threats.",
    "activity period": "2022 – Present",
    "notable": "Has drawn FBI/CISA/ACSC joint advisories due to its impact on critical infrastructure and shifting extortion model.",
    "victims & reach": "Multiple industries across North America, Australia, and Europe.",
    "impact": "Data theft, extortion pressure, and operational disruption without always encrypting systems."
  },
  {
    "name": "Blackbasta",
    "origin": "Russia",
    "description": "Blackbasta (also styled Black Basta) is a Ransomware-as-a-Service (RaaS) operation active since early 2022. It encrypts systems and exfiltrates data for double extortion, threatening publication of stolen information on a public leak site.",
    "type": "Crypto-Ransomware, HumOR, Ransomware-as-a-Service (RaaS)",
    "status": "Activity declined in 2025 but historically significant",
    "activity": "Previously very active with hundreds of victims worldwide; Q2 2025 saw a notable drop in observed attacks.",
    "tactics & techniques": "Phishing, vulnerability exploitation for initial access, credential harvesting, lateral movement, data exfiltration with double extortion.",
    "activity period": "2022 – Present (reduced activity)",
    "notable": "Linked to over 500 victims including healthcare, infrastructure, and large enterprises across North America, Europe and Australia.",
    "victims & reach": "Hundreds of victims globally.",
    "impact": "Significant extortion losses, disruption to business operations, and public data leaks."
  },
  {
    "name": "Blackbyte",
    "origin": "Russia",
    "description": "Blackbyte is a Ransomware-as-a-Service (RaaS) family that encrypts victim data and exfiltrates sensitive information, threatening its public release if ransom demands are unmet. It has been associated with exploitation of Microsoft Exchange vulnerabilities and other network access methods.",
    "type": "Crypto-Ransomware, Ransomware-as-a-Service (RaaS)",
    "status": "Active",
    "activity": "Documented attacks worldwide against government, infrastructure, and corporate targets.",
    "tactics & techniques": "Uses initial access through vulnerabilities and phishing, encrypts with AES-256 and RSA key protection, steals data for extortion.",
    "activity period": "2021 – Present",
    "notable": "Subject of FBI and U.S. Secret Service advisories.",
    "victims & reach": "Organizations across multiple sectors internationally.",
    "impact": "Operational disruption, encrypted systems, and extortion demands."
  },
  {
    "name": "Blacklock",
    "description": "Blacklock is a ransomware operation that rebranded from the Eldorado group around March 2024. It operates as a Ransomware-as-a-Service (RaaS) and uses double extortion, encrypting victim systems and exfiltrating data to pressure payments.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active and rapidly growing in 2025",
    "activity": "Aggressive expansion targeting technology, manufacturing, construction, finance and retail sectors with identified leak site infrastructure.",
    "tactics & techniques": "Double extortion with encryption and data leak threats; uses custom ransomware and network intrusion tactics.",
    "activity period": "2024 – Present",
    "notable": "Rapidly rising ransomware threat with dozens of confirmed victims and leak site exposures.",
    "victims & reach": "Victims across multiple industries; dozens of cases observed.",
    "impact": "Significant extortion losses and data exposure risk."
  },
  {
    "name": "Blackmatter",
    "origin": "Russia",
    "description": "BlackMatter was a Ransomware-as-a-Service (RaaS) operation positioned as a successor to DarkSide, combining file encryption with data exfiltration for double extortion. It targeted large enterprises across sectors before shutting down operations in late 2021.",
    "type": "Crypto-Ransomware, HumOR, Ransomware-as-a-Service (RaaS)",
    "status": "Defunct",
    "activity": "Active in 2021 targeting large Windows and Linux systems including VMware ESXi; ceased operations under this name by late 2021.",
    "tactics & techniques": "Double extortion, ransomware encryption with RSA and modern cryptography, network intrusion via vulnerabilities and stolen credentials.",
    "activity period": "2021",
    "notable": "Seen as DarkSide successor with high-profile victims before shutdown.",
    "victims & reach": "Global enterprises, critical infrastructure, and multinational targets.",
    "impact": "Substantial disruption before disbanding; code and affiliates influenced later groups."
  },
  {
    "name": "Blackout",
    "description": "Blackout is a ransomware operation that uses a double-extortion model, encrypting systems and threatening the publication of stolen data on a Tor-based leak site. It has impacted victims across various sectors including healthcare, mining, and telecommunications.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Targeted victims in France, Canada, Mexico, Croatia, and Spain with customized encryptors and leak site threats.",
    "tactics & techniques": "Standard ransomware encryption with data exfiltration and public leak pressure.",
    "activity period": "2024 – Present (last observed activity in 2024 leak posts)",
    "notable": "Noted for international reach early in its observed activity.",
    "victims & reach": "Multiple countries and sectors.",
    "impact": "Encrypted systems and extortion via data leaks."
  },
  {
    "name": "Blacksuit",
    "description": "Blacksuit is a ransomware group that evolved from or is closely related to the Royal Ransomware family, operating with double extortion tactics to encrypt systems and steal data. It targets both Windows and Linux environments including VMware ESXi.",
    "type": "Crypto-Ransomware",
    "status": "Active (with reduced activity reported)",
    "activity": "Documented activity with hundreds of victims as of mid-2025; activity levels have fluctuated.",
    "tactics & techniques": "Double extortion, encryption with data exfiltration, network intrusion, lateral movement and persistence.",
    "activity period": "2023 – Present",
    "notable": "Significant code overlap with Royal Ransomware, indicating lineage from pre-existing ransomware families.",
    "victims & reach": "Victims in multiple sectors including aviation, construction and retail.",
    "impact": "Business disruption, ransomware extortion, and data exposure."
  },
  {
    "name": "Bluelocker",
    "description": "Bluelocker is noted in ransomware tracking databases and has been associated with attacks on Pakistan’s vital energy sector, including targeting Pakistan Petroleum. Specific public technical and threat intelligence details are limited in OSINT sources.",
    "type": "Crypto-Ransomware",
    "status": "Active",
    "activity": "Linked to at least a few victim postings in 2025 targeting critical infrastructure.",
    "tactics & techniques": "Likely uses data encryption and extortion, but details are not widely published.",
    "activity period": "2025",
    "notable": "Associated with attacks on energy sector organizations in Pakistan.",
    "victims & reach": "Multiple victims in the energy sector region.",
    "impact": "Disruption and extortion in targeted infrastructure."
  },
  {
    "name": "Bqtlock",
    "origin": "Lebanon",
    "description": "Bqtlock (also referred to as BQT.Lock or BaqiyatLock) is a ransomware group that emerged in mid-2025. Reports indicate it operates as a ransomware-as-a-service (RaaS) platform with a mix of financial extortion and ideological motivation.",
    "type": "Crypto-Ransomware, Data Broker, Ransomware-as-a-Service (RaaS)",
    "status": "Active",
    "activity": "Observed encrypting numerous victims since mid-2025, utilizing Tor leak sites and Dark Web communications.",
    "tactics & techniques": "Hybrid AES-256/RSA-4096 encryption, data exfiltration via webhooks, credential theft, use of dark web leak sites and Telegram bots.",
    "activity period": "2025 – Present",
    "notable": "Rapidly emerged with claims of hundreds of attacks and ideological associations cited by some sources.",
    "victims & reach": "Claims victims in United States, India, Saudi Arabia, UAE, and Israel.",
    "impact": "Data loss and encryption with extortion pressure reported across multiple sectors."
  },
  {
    "name": "Braincipher",
    "origin": "First observed mid-2024",
    "description": "Braincipher (Brain Cipher) is a ransomware group that emerged in 2024. It uses payloads derived from leaked LockBit 3.0 builders and engages in multi-pronged extortion, including encryption and data theft.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Active since around June 2024 with confirmed victims in government and corporate sectors.",
    "tactics & techniques": "Derived from LockBit 3.0 codebase, uses strong encryption and TOR-based leak site extortion, multi-stage network compromise, and data exfiltration.",
    "activity period": "2024 – Present",
    "notable": "Significant attack on the Indonesian National Data Center demanding tens of millions in ransom.",
    "victims & reach": "Confirmed victims include government infrastructure and private sector targets.",
    "impact": "Major operational disruption and extortion demands, including large ransom amounts."
  },
  {
    "name": "Brotherhood",
    "description": "Brotherhood is an active ransomware-linked data broker group focused on extortion rather than traditional encryption-only ransomware. The group operates leak-based extortion infrastructure and publicly releases stolen data to pressure victims into payment.",
    "type": "Data Broker",
    "status": "Active",
    "activity": "Engages in direct and double extortion campaigns by publishing stolen data on dark web leak platforms and threatening further exposure.",
    "tactics & techniques": "Direct extortion, double extortion, free data leaks, victim shaming via TOR-based leak site, anonymous communication through email and Tox.",
    "activity period": "October 2025 – Present",
    "notable": "Operates a dedicated TOR leak site and provides free data leaks as a pressure tactic. Uses OnionMail email and Tox for victim communication.",
    "victims & reach": "At least 10 known victims across multiple sectors; full geographic spread not publicly disclosed.",
    "impact": "Data exposure, reputational damage, and financial extortion pressure on affected organizations."
  },
  {
    "name": "Cactus",
    "description": "Cactus is a ransomware-as-a-service (RaaS) group that has grown rapidly since 2023. It employs a double-extortion model, encrypting victim files and threatening to leak stolen data if ransom demands are not met. The group is known for exploiting vulnerabilities in VPN appliances and other remote access systems to gain initial access.",
    "type": "Crypto-Ransomware, Data Broker, Ransomware-as-a-Service (RaaS)",
    "status": "Active",
    "activity": "Active across multiple regions targeting large enterprises, with continued leak site postings through 2025.",
    "tactics & techniques": "Double extortion, exploitation of vulnerabilities (e.g., VPN devices), data exfiltration, backup deletion, use of advanced encryption.",
    "activity period": "2023 – Present",
    "notable": "Rapid expansion with high-profile victims including Schneider Electric and others in manufacturing and services sectors.",
    "victims & reach": "Targets worldwide in manufacturing, technology, and public services.",
    "impact": "Widespread disruptions, encrypted systems, and public data exposures."
  },
  {
    "name": "Cephalus",
    "description": "Cephalus is an active ransomware and data broker group first observed in June 2025. It conducts both traditional crypto-ransomware operations and data extortion by threatening to leak stolen information.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Engages in direct and double extortion campaigns via a TOR leak site and uses public forums for communication and negotiation.",
    "tactics & techniques": "Direct extortion, double extortion, free data leaks, use of TOR services for leak hosting, and communication via forums and Tox identifiers.",
    "activity period": "June 2025 – Present",
    "notable": "Operates a dedicated TOR leak site and is present on underground forums. Samples of associated binaries (SHA-256) have been publicly identified.",
    "victims & reach": "At least 8 known victims; sector and geographic specifics vary and are publicly limited.",
    "impact": "Encrypted systems, data exposure, extortion pressure, and reputational risk to affected organizations."
  },
  {
    "name": "Chaos",
    "description": "Chaos is a rapidly evolving ransomware-as-a-service (RaaS) group first observed in early 2025. It conducts aggressive double-extortion campaigns, encrypting data across Windows, Linux, ESXi, and NAS systems while threatening to leak exfiltrated data publicly.",
    "type": "Data Broker",
    "status": "Active",
    "activity": "Targets a variety of industries including technology, finance, logistics, construction, and manufacturing with dozens of listed victims.",
    "tactics & techniques": "Exploitation of vulnerabilities, phishing, brokered credentials for initial access, fast encryption, data theft and public leak threats.",
    "activity period": "2025 – Present",
    "notable": "Became prominent quickly with sophisticated panel support for affiliates.",
    "victims & reach": "At least 25–30 organizations publicly listed across U.S., Europe, and Asia.",
    "impact": "Significant operational disruption, data theft and extortion pressure on victims."
  }
]