[
  {
    "name": "0mega",
    "description": "0mega (with a zero instead an O) is a ransomware group that seemingly moves slowly based on the rate at which they add victims to their extortion page. They've added three victims to their extortion website - available on both Clearnet and TOR - in the first year of their existence. However, don't be fooled; it's very likely that more attacks are occurring but aren't listed due to the victim paying or because the attack wasn't successful (enough). The group may act gingerly, but because there is yet to be a known sample or analysis of this ransomware, it's difficult to uncover the group's tactics and techniques of infiltrating networks, not to mention the telemetry of when they breach. We are aware of at least one other victim when Obsidian Security's threat research team revealed in a blog post a SaaS account compromise that led to data theft. Allegedly, they didn't encrypt any files during this breach. However, they did drop a ransom note titled \"PREVENT-LEAKAGE.txt\"",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active (low activity)",
    "activity": "Ransomware with double-extortion model including data theft",
    "tactics & techniques": "File encryption, data exfiltration, cloud account compromise, extortion via leak threats",
    "activity period": "May 2022 – 2024",
    "notable": "Known for abusing Microsoft 365 admin access in some incidents",
    "victims & reach": "Small to mid-sized organizations",
    "impact": "Limited global impact compared to major ransomware families"
  },
  {
    "name": "8base",
    "origin": "Thailand",
    "description": "8Base is an aggressive ransomware and data-extortion collective that became a major global threat between 2022 and 2025. The group's operations were severely disrupted in February 2025 through \"Operation Phobos Aetor,\" a coordinated international law enforcement effort involving the FBI, Europol, and authorities from several other nations.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Disrupted (law enforcement action)",
    "activity": "Ransomware and data-leak extortion operations",
    "tactics & techniques": "Phishing, initial access brokers, AES-based encryption, double extortion",
    "activity period": "2022 – 2025",
    "notable": "International law enforcement arrests and server seizures in 2025",
    "victims & reach": "Hundreds of victims across multiple industries worldwide",
    "impact": "High; associated with the Phobos ransomware ecosystem"
  },
  {
    "name": "Abyss",
    "description": "Abyss (also known as Abyss Locker) is a sophisticated ransomware-as-a-service (RaaS) operation that first gained prominence in March 2023. As of January 2026, it remains an active and evolving threat, known for its technical versatility across multiple platforms.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Double-extortion ransomware operations",
    "tactics & techniques": "Data exfiltration, file encryption, ESXi targeting, ChaCha-based encryption",
    "activity period": "2023 – Present",
    "notable": "Uses a public leak site to pressure victims",
    "victims & reach": "Enterprises across multiple regions",
    "impact": "Moderate but growing"
  },
  {
    "name": "Adminlocker",
    "description": "Adminlocker is a low-profile, opportunistic ransomware strain active since late 2021 that primarily targets individual users and small businesses through cracked software and malicious email attachments. Operating as a likely independent or small-scale group with unconfirmed geographical origins, it utilizes a hybrid of AES and RSA encryption to lock files—often appending extensions like .admin1 or .1admin—and demands Bitcoin payments via local text file instructions. Unlike more advanced syndicates, Adminlocker typically focuses on single-extortion file encryption rather than maintaining a public data-leak site, resulting in a more localized and limited global impact as of 2026.",
    "status": "Active (low visibility)",
    "activity": "File-encrypting ransomware",
    "tactics & techniques": "Symmetric and asymmetric encryption, ransom notes via local files",
    "activity period": "2021 – Present",
    "notable": "Uses multiple file extensions such as .admin1",
    "victims & reach": "Small businesses and individual systems",
    "impact": "Limited and localized"
  },
  {
    "name": "Akira",
    "description": "Akira is a prominent Russian-linked Ransomware-as-a-Service (RaaS) operation that emerged in early 2023 and has since evolved into a Tier-1 global threat, extorting an estimated $244 million from over 1,000 victims by early 2026. The group, frequently linked to the defunct Conti syndicate, employs a sophisticated double-extortion strategy that combines data exfiltration with high-speed encryption across Windows, Linux, VMware ESXi, and newer Nutanix AHV environments. Their primary tactics involve opportunistic exploitation of unpatched VPN vulnerabilities (notably in Cisco and SonicWall devices) and the abuse of single-factor authentication to gain initial access. As of January 2026, Akira remains highly active, recently shifting toward \"pure extortion\" models that bypass traditional encryption to focus on high-leverage data theft from mid-market firms and critical infrastructure sectors globally.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Ransomware with double-extortion strategy",
    "tactics & techniques": "Credential abuse, VPN exploitation, data exfiltration, Rust-based encryption",
    "activity period": "March 2023 – Present",
    "notable": "Targets Windows, Linux, and VMware ESXi systems",
    "victims & reach": "Hundreds of organizations globally",
    "impact": "High; millions of dollars in ransom demands"
  },
  {
    "name": "Alphalocker",
    "description": "The first mentions of Alpha Locker, or Alpha, appeared in Bleeping Computer's forums in the Summer of 2023. However, in early January, the group appeared more ubiquitously within the cybersecurity community. This group is also known as \"mydaya\" because of the TOR domain name on which they host their data leak site. Nothing is known about the group besides what is on the data leak site and what is published on the Bleeping Computer forums.",
    "type": "Crypto-Ransomware, Data Broker",
    "status": "Active",
    "activity": "Ransomware and data extortion operations",
    "tactics & techniques": "File encryption, data leakage threats, Tor-based negotiations",
    "activity period": "2024 – Present",
    "notable": "Distinct from older AlphaLocker variants; modern extortion group",
    "victims & reach": "Approximately 30 publicly disclosed victims",
    "impact": "Moderate"
  },
  {
    "name": "Abraham's Ax",
    "origin": "Iran",
    "description": "Abraham's Ax appears to be a \"one and done\" operation. Based on multiple characteristics of the extortion link site, the operators seem to be linked to Moses Staff, an Iranian hacktivist group. Researchers from IBM highlighted all of the similarities between the groups, which is further attributed to an entity dubbed COBALT SAPLING. Since these groups are allegedly the same threat actors, they subsequently use the same tactics, techniques, and procedures (TTPs). The group leverages a remote access trojan (RAT) called StrifeWater RAT, which allows them to send remote commands and deploy what we can assume is ransomware. Although, there is no evidence of ransomware ever being deployed.",
    "type": "Data Broker",
    "status": "Inactive / One-time operation",
    "activity": "Data extortion and data leakage without confirmed ransomware deployment",
    "tactics & techniques": "Use of StrifeWater RAT, data exfiltration, direct and double extortion, hacktivist-style operations",
    "activity period": "November 2022",
    "notable": "Linked to Iranian hacktivist group Moses Staff and threat cluster COBALT SAPLING",
    "victims & reach": "Government sector; Saudi Arabian Ministry of Interior",
    "impact": "High political and reputational impact but limited operational scale"
  },
  {
    "name": "ALPHV (BlackCat / Noberus)",
    "origin": "Russia",
    "description": "A high-profile ransomware-as-a-service (RaaS) gang that deploys the ALPHV ransomware written in Rust. It uses advanced double- and sometimes triple-extortion techniques. Operates via affiliates who deploy the malware and share ransom profits. Maintains public leak sites for stolen data.",
    "type": "Crypto-Ransomware, Ransomware-as-a-Service (RaaS)",
    "status": "Disrupted / largely inactive post-2024; infrastructure seized by law enforcement.",
    "activity": "Previously highly active across multiple industries, but operations diminished following takedown.",
    "tactics & techniques": "Double extortion (encrypt + data leak), sometimes triple extortion; exploitation, credential theft; custom Rust binary.",
    "activity period": "First observed in late 2021, peaked through 2023; disrupted late 2023–2024.",
    "notable": "One of the most active ransomware strains with reputed ties to FIN7 and DarkSide affiliates.",
    "victims & reach": "Hundreds of victims worldwide across government, healthcare, education, manufacturing, etc.",
    "impact": "Significant global impact, major ransom payments, data leaks, and operational disruption."
  },
  {
    "name": "Apt73",
    "description": "Emerging ransomware group identified by threat intel platforms; minimal verified public profile. Known channels like Ransomware.Live list it with some reported victims but lack official analysis.",
    "type": "Crypto-Ransomware, Data Broker, Ransomware-as-a-Service (RaaS)",
    "status": "Active (reported victims listed)",
    "activity": "Linked to multiple claimed attacks per dark web tracking sites.",
    "tactics & techniques": "Details not widely published; associated with claimed attacks.",
    "activity period": "Reported mid-2024 onward.",
    "notable": "Listed as a ransomware group with a modest victim count.",
    "victims &